from persianttsfarsi import PersianTTS

output_path = r"C:\Users\User_1\Desktop\tts_o3.mp3"

text = """وزیر دفاع عربستان سعودی در راس یک هیئت بلند پایه نظامی امروز به ایران سفر می‌کند.

به گزارش ایسنا، خالد بن سلمان آل سعود، وزیر دفاع عربستان سعودی که به دعوت سرلشکر محمد باقری رییس ستاد کل نیروهای مسلح جمهوری اسلامی ایران به ایران سفر می‌کند در این سفر علاوه بر رئیس ستاد کل نیروهای مسلح با مقامات ارشد سیاسی و امنیتی کشورمان دیدار و گفت‌وگو خواهد کرد.

 توسعه مناسبات دفاعی و همکاری‌های منطقه‌ای برای تقویت صلح و ثبات در منطقه و همچنین مبارزه با تروریسم از جمله محورهای گفت‌وگوی دو مقام ارشد دفاعی ایران و عربستان در این دیدار است.
 

بر اساس این گزارش سال گذشته نیز رئیس ستاد کل نیروهای مسلح عربستان سعودی به دعوت سرلشکر باقری به تهران سفر کرده بود و سفر خالد بن سلمان وزیر دفاع عربستان دومین سفر مقام ارشد دفاعی این کشور به ایران است."""


# text = "سلام دنیا! این یک مثال از تبدیل متن به گفتار فارسی است."

tts = PersianTTS()
tts.synthesize(text, output_path)
